{
    "whalefacts": [
        "Whales are a common name for marine mammals.",
        "The term ‘whale’ often excludes dolphins and porpoises.",
        "Toothed whales have small teeth which are primarily used for hunting. Examples of these whales include beluga, orca (also known as the ‘killer’) and sperm.",
        "Filter feeders have baleens which filter plankton. Examples of these whales include blue, humpback and minke.",
        "Whales are part of the ‘cetacea’ family as they have fins, flukes and blowholes.",
        "The largest whale in the world was the blue whale at 30 meters and over 180 tonnes, whereas the smallest was the pygmy sperm whale at 3.5m.",
        "Whales have been hunted for their meat, bones and for medicinal purposes.",
        "Due to the practise of whaling, most species are now endangered.",
        "The hippopotamus is the whales closest living relative.",
        "Whales are descended from the Artiodactyl species of dinosaurs, which were land livers.",
        "They are warm-blooded creatures.",
        "Their blubber stores energy and insulates the body, keeping them alive through harsh winters.",
        "Baleen whales have two blowholes, whereas the toothed whales have only one.",
        "Male whales are called ‘bulls’. Females are known as ‘cows’. New borns are called ‘calves’.",
        "Most cows give births to one single calf, which is born tail first to help minimize drowning.",
        "Calves can reach maturity between 7 – 10 years.",
        "Whales live in families, known as pods.",
        "Only one hemisphere of a whales brain is asleep at one time.",
        "Scientists believe that whales are capable of teaching, learning, co-operating with others, scheming, and grieving. This was believed after studies found their cells similar to the human cells which are involved with social interactions.",
        "Breaching or cresting the surface of the ocean can be seen as signs of courting, danger, dominance and play.",
        "Killer whales spyhop in the water using their buoyancy. This is due to their inquisitive nature.",
        "When a whale slaps its fluke (tail) against the water, this is to scare smaller fish, as it forages for food.",
        "Whales communicate through a series of “songs”. Dory, in the animated film Finding Nemo believed she could speak whale.",
        "Whale watching is a popular tourist pastime, in which groups are taken onto the ocean in a large boat to witness the mammals behavior and antics.",
        "Whales feature heavily in religion and mythology. The most famous is Jonas who was eaten by a whale.",
        "Moby Dick (from the novel of the same name) and Monstro (from Disney’s Pinocchio) are the most feared whales of fiction.",
        "There are many famous films depicting whales, including Big Miracle, the Free Willy franchise, Moby Dick, Pinocchio, and Whale Rider.",
        "Injured whales are often taken into captivity to survive. However some are so used to their new lifestyles that they cannot become part of the pod once more, resulting usually in their deaths.",
        "Whales in captivity are often used for shows, such as at Sea World in Orlando, Florida. These shows heavily feature killer whales, which take part in demonstrations and are rewarded for their efforts."
    ]
}